app/Http/Controllers/Auth/LoginController.php

select * from `asset_categories` where `asset_categories`.`asset_category_id` in ('0716b480-8675-4b01-b651-a3fd039cb2ce', 'c34a0c5f-9fc0-4644-bee5-c36861f1c462') and `asset_categories`.`deleted_at` is null
select * from `item_categories` where `item_categories`.`deleted_at` is null
---
    public function login(Request $request)
    {
        $this->validate($request, [
            'username' => 'required',
            'password' => 'required',
        ]);
        $username = $request->username;
        $password = $request->password;

        $fieldType = filter_var($username, FILTER_VALIDATE_EMAIL) ? 'user_email' : 'user_name';
        if (Auth::attempt([$fieldType => $username, 'password' => $password])) {
            $user = Auth::user();
            $attributes = ['user_id' => $user->user_id, 'user_name' => $user->user_name, 'user_status', 'user_fullname' => $user->user_fullname];
            $menu = ItemCategory::with('asset_category')->get();