app/Http/Controllers/AsalolehCategoryController.php

    public function ajax(Request $request)
    {
        try {
            $asalOleh = AsalolehCategory::select('asaloleh_category_id', 'asaloleh_category_name')
                ->when($request->search, function($query, $keyword) {
                    $query->where("asaloleh_category_name", "like", "%$keyword%");
                })
                ->limit(10)
                ->get();
---
select `asaloleh_category_id`, `asaloleh_category_name` from `asaloleh_categories` where `asaloleh_categories`.`deleted_at` is null limit 10