app/Http/Controllers/AsalpengadaanCategoryController.php

    public function ajax(Request $request)
    {
        try {
            $asalpengadaan = AsalpengadaanCategory::select('asalpengadaan_category_id', 'asalpengadaan_category_name')
                ->when($request->search, function($query, $keyword) {
                    $keyword = strtolower($keyword);
                    $query->whereRaw('LOWER(`asalpengadaan_category_name`) LIKE ? ',['%'.$keyword.'%']);

                })
                ->get();
---
select `asalpengadaan_category_id`, `asalpengadaan_category_name` from `asalpengadaan_categories` where `asalpengadaan_categories`.`deleted_at` is null