app/Http/Controllers/AssetGroupController.php

    public function ajax(Request $request)
    {
        try {
            $asset = AssetGroup::with('asal_oleh', 'asal_pengadaan')
                ->when($request->search, function ($query, $keyword) {
                    $keyword = strtolower($keyword);
                    $query->whereRaw('LOWER(asset_document_number) LIKE ? ', ['%' . $keyword . '%']);
                })
                ->limit(10)
                ->get();
---
select * from `asset_groups` where LOWER(asset_document_number) LIKE '%lorem%'  and `asset_groups`.`deleted_at` is null limit 10