app/Http/Controllers/AssetController.php

    public function index(Request $request)
    {
        if($request->ajax()) {

            $asset = Asset::query()->with('asset_group', 'item', 'satuan', 'user')->where('assets.item_category_id', $request->categoryId);
            $user = Auth::user();
            if (!$user->hasPermissionTo('aset-create')) {
                $asset = $asset->where('assets.asset_used_by', $user->user_id);
            }
            return DataTables::of($asset)->make();
        }
        $assetCategory = AssetCategory::get();
---
select * from `asset_categories` where `asset_categories`.`deleted_at` is null

    public function store(Request $request)
    {
        $this->validate($request, [
            // 'asset_serial_number' => 'nullable|unique:assets,asset_serial_number,NULL,NULL,deleted_at,NULL',
            'asset_document_number' => 'required',
        ],
        [
            // 'asset_serial_number.unique' => 'Serial number sudah digunakan',
            'asset_document_number' => 'Nomor dokumen wajib diisi'
        ]);
        $input = $request->all();
        $newInput = [];
        try {
            $user = Auth::user();
            $checkDocNumber = AssetGroup::where('asset_document_number', $input['asset_document_number'])->first();
            if ($checkDocNumber) $input['asset_group_id'] = $checkDocNumber->asset_group_id;
            $getListCode = AssetTemporary::where('asset_temporary_user_id', $user->user_id)->get();
---
select * from `asset_groups` where `asset_document_number` = 'lorem' and `asset_groups`.`deleted_at` is null limit 1
select * from `asset_temporaries` where `asset_temporary_user_id` = '9d3d9b86-87e2-4160-8777-b5907544b877' and `asset_temporaries`.`deleted_at` is null