app/Http/Controllers/BahanCategoryController.php

    public function ajax(Request $request)
    {
        try {
            $bahan = BahanCategory::select('bahan_category_id', 'bahan_category_name')
                ->when($request->search, function($query, $keyword) {
                    $keyword = strtolower($keyword);
                    $query->where("bahan_category_name", "like", "%$keyword%");
                })
                ->limit(10)
                ->get();
---
select `bahan_category_id`, `bahan_category_name` from `bahan_categories` where `bahan_categories`.`deleted_at` is null limit 10