app/Http/Controllers/ItemBrandController.php

    public function ajax(Request $request)
    {
        try {
            $item = ItemBrand::select('item_brand_id', 'item_id', 'item_brand_name')
                ->when($request->search, function($query, $keyword) {
                    $query->where("item_brand_name", "like", "%$keyword%");
                })
                ->when($request->item, function($query, $item) {
                    $query->where('item_id', $item);
                }, function($query) {
                    $query->whereNull('item_id');
                })
                ->get();
---
select `item_brand_id`, `item_brand_name` from `item_brands` where `item_brands`.`deleted_at` is null