app/Http/Controllers/ItemController.php

    public function ajax(Request $request)
    {
        try {
            $item = Item::select('item_id', 'item_category_id', 'item_name', 'item_code')
                ->when($request->search, function($query, $keyword) {
                    $keyword = strtolower($keyword);
                    $query->whereRaw('LOWER(item_name) LIKE ? ',['%'.$keyword.'%']);

                })
                ->when($request->itemCategory, function($query, $itemCategory) {
                    $query->where('item_category_id', $itemCategory);
                }, function($query) {
                    $query->whereNull('item_category_id');
                })
                ->get();
---
select `item_id`, `item_category_id`, `item_name`, `item_code` from `items` where `item_category_id` = '9b674b35-acab-4916-9447-b1b23a3965a1' and `items`.`deleted_at` is null