app/Http/Controllers/ItemTypeController.php

    public function ajax(Request $request)
    {
        try {
            $type = ItemType::select('item_brand_id', 'item_type_id', 'item_type_name')
                ->when($request->search, function($query, $keyword) {
                    $keyword = strtolower($keyword);
                    $query->where("item_type_name", "like", "%$keyword%");
                })
                ->when($request->brand, function($query, $brand) {
                    $query->where('item_brand_id', $brand);
                }, function($query) {
                    $query->whereNull('item_brand_id');
                })
                ->limit(10)
                ->get();
---
select `item_brand_id`, `item_type_id`, `item_type_name` from `item_types` where `item_brand_id` = '9d3d9b88-2106-40fd-b800-183b17ec2068' and `item_types`.`deleted_at` is null limit 10