app/Http/Controllers/LocationController.php

select `location_id`, `location_name`, `address` from `locations` where `locations`.`deleted_at` is null limit 10
---
    public function ajax(Request $request)
    {
        try {
            $bahan = Location::select('location_id', 'location_name', 'address')
                ->when($request->search, function($query, $keyword) {
                    $keyword = strtolower($keyword);
                    $query->whereRaw('LOWER(location_name) LIKE ? ',['%'.$keyword.'%']);

                })
                ->limit(10)
                ->get();