app/Http/Controllers/SatuanCategoryController.php

select `satuan_category_id`, `satuan_category_name` from `satuan_categories` where `satuan_categories`.`deleted_at` is null limit 10
---
    public function ajax(Request $request)
    {
        try {
            $satuan = SatuanCategory::select('satuan_category_id', 'satuan_category_name')
                ->when($request->search, function($query, $keyword) {
                    $keyword = strtolower($keyword);
                    $query->where("satuan_category_name", "like", "%$keyword%");
                })
                ->limit(10)
                ->get();