app/Models/AssetGroup.php

insert into `asset_groups` (`asset_document_number`, `asalpengadaan_category_id`, `asaloleh_category_id`, `asset_asaloleh_date`, `asset_procurement_year`, `asset_group_items`, `asset_group_id`, `updated_at`, `created_at`) values ('lorem', '9d3d9b86-f763-4606-aa4c-05481f142a1f', '9d3d9b86-e163-4ca8-aed8-39bc98098996', '2024-10-15', '2023', '2023', '9d3fe027-24bc-40c7-8158-84fb42b14c8d', '2024-10-15 14:18:11', '2024-10-15 14:18:11')
---
    public static function updateorCreateAssetGroup($input)
    {
        if (isset($input['asset_group_id'])) {
            $updateGroup = [
                'asalpengadaan_category_id' => $input['asalpengadaan_category_id'],
                'asaloleh_category_id' => $input['asaloleh_category_id'],
                'asset_document_number' => $input['asset_document_number'],
                'asset_asaloleh_date' => Carbon::createFromFormat('d-m-Y', $input['asset_asaloleh_date'])->toDateString(),
                'asset_procurement_year' => $input['asset_procurement_year'],
            ];
            if (isset($input['asset_documents'])) $updateGroup['asset_documents'] = isset($input['asset_documents']);
            AssetGroup::where('asset_group_id', $input['asset_group_id'])->update($updateGroup);
            // if not same group recalculate
            if (isset($input['old_asset_group_id'])) {
                if ($input['old_asset_group_id'] != $input['asset_group_id']) {
                    self::decrementAssetGroup(['asset_group_id' => $input['old_asset_group_id']]);
                    self::incrementAssetGroup(['asset_group_id' => $input['asset_group_id']]);
                }
            }
            return AssetGroup::where('asset_group_id', $input['asset_group_id'])->first();
        }  else {
            $createAssetGroup = AssetGroup::create($input);