app/Models/AssetGroup.php

update `asset_groups` set `deleted_at` = '2024-10-15 15:26:57', `asset_groups`.`updated_at` = '2024-10-15 15:26:57' where `asset_group_id` = '9d3fe342-8360-4f53-8844-8d02049129b6'
---
    public static function deleteAsset($id)
    {
        try {
            $assetGroup = assetGroup::findOrFail($id);
            $assetGroup->delete();

insert into `asset_groups` (`asset_document_number`, `asalpengadaan_category_id`, `asaloleh_category_id`, `asset_asaloleh_date`, `asset_procurement_year`, `asset_group_items`, `asset_group_id`, `updated_at`, `created_at`) values ('lorem 8', '9d3d9b86-f763-4606-aa4c-05481f142a1f', '9d3d9b86-e163-4ca8-aed8-39bc98098996', '2024-10-15', '2023', '2398232', '9d3ff6b8-cddf-46b7-846c-84b3daa17b93', '2024-10-15 15:21:18', '2024-10-15 15:21:18')
---
            }
            return AssetGroup::where('asset_group_id', $input['asset_group_id'])->first();
        }  else {
            $createAssetGroup = AssetGroup::create($input);